---
title: MasonryCMU
classe: Autodesk.Revit.DB.Visual.MasonryCMU
namespace: Autodesk.Revit.DB.Visual
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# MasonryCMU

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String CommonTintColor { get; }` | `MasonryCMU.CommonTintColor` | String |
| `String CommonTintToggle { get; }` | `MasonryCMU.CommonTintToggle` | String |
| `String MasonryCMUApplication { get; }` | `MasonryCMU.MasonryCMUApplication` | String |
| `String MasonryCMUColor { get; }` | `MasonryCMU.MasonryCMUColor` | String |
| `String MasonryCMUColorByObject { get; }` | `MasonryCMU.MasonryCMUColorByObject` | String |
| `String MasonryCMUPattern { get; }` | `MasonryCMU.MasonryCMUPattern` | String |
| `String MasonryCMUPatternHeight { get; }` | `MasonryCMU.MasonryCMUPatternHeight` | String |
| `String MasonryCMUPatternMap { get; }` | `MasonryCMU.MasonryCMUPatternMap` | String |
| `String MasonryCMUType { get; }` | `MasonryCMU.MasonryCMUType` | String |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```